Revit 2027 API
AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings other
)
Public Sub New (
	other As AnalysisDisplayMarkersAndTextSettings
)
public:
AnalysisDisplayMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings^ other
)
new :
        other : AnalysisDisplayMarkersAndTextSettings -> AnalysisDisplayMarkersAndTextSettings
Parameters
other AnalysisDisplayMarkersAndTextSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
AnalysisDisplayMarkersAndTextSettings Overload
Autodesk.Revit.DB.Analysis Namespace